user_answer = [] # вот сюда получаем ответы с сайта
user_id = 1 # это уникальная информация о пользователе


B1 = [1, '-', 1, '-', 0, '-', '-', 1, '-', 1, '-', '-', 1,
                '-', 0, '-', 1, '-', '-', 0, '-', 1, '-', '-', 1, '-',
                1, '-', 0, '-', '-', 0, '-', 0, '-', '-', 0, '-', 1,
                '-', 0, '-', '-', 1, '-', 1, '-', '-', 1, '-', 0, '-',
                1, '-', '-', 1, '-']

B2 = ['-', '-', '-', '-', 1, '-', '-', '-', '-', '-', '-', '-',
               '-', '-', 1, '-', '-', '-', '-', 1, '-', '-', '-', '-', '-',
               '-', '-', '-', 1, '-', '-', 1, '-', 1, '-', '-', 1, '-', '-',
               '-', 1, '-', '-', '-', '-', '-', '-', '-', '-', '-', 1, '-',
               '-', '-', '-', '-', '-']

C1 = ['-', 1, '-', 1, '-', '-', 1, '-', 1, '-', 1, '-', '-', 1,
             '-', 1, '-', '-', 1, '-', 1, '-', 1, '-', '-', '-', '-',
             1, '-', '-', 1, '-', 1, '-', 1, '-', '-', 1, '-', 1, '-',
             '-', 1, '-', 1, '-', 1, '-', '-', 1, '-', 1, '-', '-', 1, 1, '-']


result = {user_id:{'Ложные ответы': 0,
                   'показатель Б': 0,
                   'показатель В': 0,
                   'психотип1': '',
                   'психотип2': ''}}

A1 = [5, 23, 35]
A2 = [11, 17, 29, 41, 47, 53]

for id_ans in range(len(user_answer)):
    if user_answer[id_ans] == 1:
        if id_ans in A2:
            result[user_id]['Ложные ответы'] += 1
        if B2[id_ans] == 1 or B1[id_ans] == 1:
            result[user_id]['показатель Б'] += 1
        elif C1[id_ans] == 1:
            result[user_id]['показатель В'] += 1
    elif user_answer[id_ans] == 0:
        if id_ans in A1:
            result[user_id]['Ложные ответы'] += 1
        if B1[id_ans] == 0:
            result[user_id]['показатель Б'] += 1

if result[user_id]['показатель Б'] == 12 or result[user_id]['показатель В'] == 12:
    result[user_id]['психотип1'] = 'Результат не подлежит анализу'
elif 0 <= result[user_id]['показатель Б'] <= 12 and 0 <= result[user_id]['показатель В'] <= 12:
    result[user_id]['психотип1'] = 'Флегматик'
elif 0 <= result[user_id]['показатель Б'] <= 12 and 12 <= result[user_id]['показатель В'] <= 24:
    result[user_id]['психотип1'] = 'Меланхолик'
elif 12 <= result[user_id]['показатель Б'] <= 24 and 12 <= result[user_id]['показатель В'] <= 24:
    result[user_id]['психотип1'] = 'Холерик'
elif 12 <= result[user_id]['показатель Б'] <= 24 and 0 <= result[user_id]['показатель В'] <= 12:
    result[user_id]['психотип1'] = 'Сангвиник'

if result[user_id]['Ложные ответы'] > 4:
    general = 'Ответы ложные, не имеет смысла анализировать данный результат'
elif result[user_id]['показатель Б'] >= 19:
        general = 'яркий экстраверт'
elif result[user_id]['показатель Б'] >= 15:
    general = 'экстраверт'
elif result[user_id]['показатель Б'] >= 12:
    general = 'склонность к экстраверсии'
elif result[user_id]['показатель Б'] == 12:
    general = 'среднее значение, неопределённый тип личности'
elif result[user_id]['показатель Б'] <= 5:
    general = 'глубокий интроверт'
elif result[user_id]['показатель Б'] <= 9:
    general = 'интроверт'
elif result[user_id]['показатель Б'] < 12:
    general = 'склонность к интроверсии'
result[user_id]['психотип2'] = general
print(result)




